import DocTitle from '../../components/DocTitle';
import style from './PrivacyPage.module.css';

const PrivacyPage = () => {
  return (
    <main className={style.mainContainer}>
      <DocTitle>Delivery</DocTitle>
      <h2 className={style.titlePrivacy}>Політика конфіденційності</h2>
      <p><strong>Опублікована: 05 листопада, 2024 року</strong></p>
      <p>
        Інтернет-магазин{' '}
        <a href="https://tata-ovchinnikova.vercel.app" target="_blank">
          https://tata-ovchinnikova.vercel.app
        </a>
        , надалі - “інтернет-магазин”, приділяє велику увагу захисту
        персональних даних своїх користувачів. Користувачі інтернет-магазину
        можуть переглядати сторінки сайту не повідомляючи про себе ніяких
        персональних даних. Однак, для надання послуг, пов'язаних з купівлею
        товарів, представлених в нашому інтернет-магазині, нам потрібні Ваші
        контактні дані для того, щоб ми могли зв'язатися з Вами, підтвердити
        замовлення і доставити Вам замовлений товар. Ваші персональні дані ми не
        передаємо третім особам і захищаємо їх конфіденційність.
      </p>

      <h3 className={style.titlePrivacy}>1. Загальні положення</h3>
      <p>
        1.1 Дана політика конфіденційності встановлює порядок отримання,
        зберігання, обробки, використання і розкриття персональних даних
        Користувача. Персональні дані Користувача ми отримуємо від Користувача
        при оформленні замовлення через форму замовлення, при оформленні
        замовлення за телефонами, які вказані на сайті. Персональні дані
        Користувача заповнюються Користувачем (при оформленні замовлення або при
        реєстрації на сайті). Обов'язкова для надання послуги інформація
        позначена спеціальним чином. Інша інформація надається Користувачем на
        його розсуд.
      </p>
      <p>
        1.2 Конфіденційність персональних даних - обов'язкова умова для
        дотримання магазином доступу до персональних даних Користувача, з
        вимогою не допускати їх поширення без згоди Користувача або наявності
        іншої законної підстави.
      </p>
      <p>
        1.3 Використання Користувачем сайту інтернет-магазину означає згоду з
        цією Політикою конфіденційності та умовами обробки персональних даних
        Користувача.
      </p>
      <p>
        1.4 У випадку незгоди з умовами Політики Користувач повинен припинити
        використання сайту інтернет-магазину.
      </p>
      <p>
        1.5 Ця Політика застосовується тільки до сайту інтернет-магазину.
        Інтернет-магазин не контролює і не несе відповідальність за сайти третіх
        осіб, на які Користувач може перейти по посиланнях, доступним на сайті
        інтернет-магазину.
      </p>
      <p>
        1.6 Адміністрація сайту не перевіряє достовірність персональних даних,
        що надаються Користувачем сайту Інтернет-магазину.
      </p>

      <h3 className={style.titlePrivacy}>2. Персональні дані</h3>
      <p>
        2.1 Інтернет-магазин збирає персональні дані, а саме: ім'я, прізвище,
        контактний телефон, адреса електронної пошти, адреса для доставки.
        Також, ми можемо уточнити і отримати від Вас цю інформацію по телефону.
      </p>
      <p>2.2 Інша інформація надається Користувачем на його розсуд.</p>
      <p>2.3 Інтернет-магазин не збирає IP-адреси користувачів.</p>

      <h3 className={style.titlePrivacy}>
        3. Цілі збору і обробки персональних даних користувачів
      </h3>
      <p>
        3.1 Інтернет-магазин збирає і зберігає тільки ті персональні дані, які
        необхідні для надання послуг з продажу і доставки замовлених Вами
        товарів.
      </p>
      <p>
        3.2 Інтернет-магазин збирає дані для зв'язку з Користувачем, в тому
        числі подання відповідного повідомлення про надання послуги,
        інформування Користувача про наявність товару, підтвердження замовлення,
        доставки замовлених Користувачем товарів, для зв'язку кур'єрської служби
        з Користувачем, а також для обробки запитів і заявок від Користувача.
      </p>
      <p>
        3.3 Обробка персональних даних Користувача здійснюється без обмеження
        терміну, будь-яким законним способом.
      </p>

      <h3 className={style.titlePrivacy}>
        4. Умови надання доступу до бази даних
      </h3>
      <p>
        4.1 Ми не передаємо персональні дані Користувача третім особам крім
        випадків визначених законодавством України.
      </p>
      <p>
        4.2 Розкриття персональних даних Користувача проводиться при замовленні
        Користувачем товарів в інтернет-магазині. Зокрема Користувач
        погоджується з тим, що інтернет-магазин має права передавати персональні
        дані кур'єрським службам, організаціям поштового зв'язку, операторам
        електрозв'язку, виключно з метою виконання замовлення Користувача,
        оформленого на сайті інтернет-магазину, включаючи доставку Товару.
      </p>

      <h3 className={style.titlePrivacy}>
        5. Зміна Користувачем персональної інформації
      </h3>
      <p>
        5.1 Користувач може в будь-який момент змінити (оновити, доповнити,
        видалити) надану їм персональну інформацію або її частину любим
        доступним способом на сайті чи по телефону.
      </p>

      <h3 className={style.titlePrivacy}>6. Зміна Політики конфіденційності</h3>
      <p>
        6.1 Ми маємо право змінити умови Політики конфіденційності. У такому
        випадку, ми замінимо версію документа на сторінці "Політика
        конфіденційності", зміни набувають чинності з моменту їх публікації.
        Будь ласка, періодично переглядайте ці умови, щоб бути поінформованими
        про те, як інтернет-магазин захищає персональні дані своїх користувачів.
      </p>

      <h3 className={style.titlePrivacy}>
        7. Зворотній зв'язок. Питання та пропозиції
      </h3>
      <p>
        7.1 Всі пропозиції або питання поп приводу цієї Політики слід
        повідомляти в службу підтримки користувачів інтернет-магазину по
        вказаним контактним даним на самому сайті.
      </p>
    </main>
  );
};

export default PrivacyPage;
